#define _CRT_SECURE_NO_WARNINGS 
#include<stdio.h>;
#include<windows.h>;
#include<math.h>;
static int table[100] = {
    [0] = 0,
    [1] = 15,
    [2] = 30,
    [3] = 30,
    [4] = 35,
    [5] = 35,
    [6] = 35,
    [7] = 40,
    [8] = 40,
    [9] = 40,
    [10] = 60,
    [11] = 90,
    [12] = 105,
    [13] = 120,
    [14] = 140,
    [15] = 160,
    [16] = 180,
    [17] = 205,
    [18] = 230,
    [19] = 255,
    [20] = 285,
    [21] = 315,
    [22] = 345,
    [23] = 375,
    [24] = 410,
    [25] = 445,
    [26] = 480,
    [27] = 520,
    [28] = 560,
    [29] = 600,
    [30] = 645,
    [31] = 690,
    [32] = 735,
    [33] = 780,
    [34] = 830,
    [35] = 880,
    [36] = 930,
    [37] = 985,
    [38] = 1040,
    [39] = 1095,
    [40] = 1155,
    [41] = 1215,
    [42] = 1275,
    [43] = 1335,
    [44] = 1400,
    [45] = 1465,
    [46] = 1530,
    [47] = 1600,
    [48] = 1670,
    [49] = 1740,
    [50] = 1815,
    [51] = 1890,
    [52] = 1965,
    [53] = 2040,
    [54] = 2120,
    [55] = 2200,
    [56] = 2280,
    [57] = 2365,
    [58] = 2450,
    [59] = 2535,
    [60] = 2625,
    [61] = 2715,
    [62] = 2805,
    [63] = 2895,
    [64] = 2990,
    [65] = 3085,
    [66] = 3180,
    [67] = 3280,
    [68] = 3380,
    [69] = 3480,
    [70] = 3585,
    [71] = 3690,
    [72] = 3795,
    [73] = 3900,
    [74] = 4010,
    [75] = 4120,
    [76] = 4230,
    [77] = 4345,
    [78] = 4460,
    [79] = 4575,
    [80] = 4695,
    [81] = 4815,
    [82] = 4935,
    [83] = 5055,
    [84] = 5180,
    [85] = 5305,
    [86] = 5430,
    [87] = 5560,
    [88] = 5690,
    [89] = 5820,
    [90] = 5955,
    [91] = 6090,
    [92] = 6225,
    [93] = 6360,
    [94] = 6500,
    [95] = 6640,
    [96] = 6780,
    [97] = 6925,
    [98] = 7070,
    [99] = 7215,
};
int main()
{
    char choice='0';
    int c;     //清除变量
	int x, y, z;          //变量
	int b=0;                //b是经验总值
	int n,n1,n2,n3,n4 ;  //摸头 普通礼物 小笑脸 大小脸 紫礼物
	int a = 1;                 //循环变量
    printf("\033[31m注意！全程请不要输入小数！！！\33[0m\n");
    do {
        while (1)
        {                                            //开始循环检测
            //while (1) {                                                                    //我不会指针，未来改读小数
                printf("\n请输入当前好感度等级：");
                /* if*/(scanf(" %d", &x) == 1);while ((c = getchar()) != '\n' && c != EOF) {}
                //{ break; }
            //    else {
            //        printf("请输入一个整数！");
            //        while (getchar() != '\n');
            //    }
            //}
            //while (1) {
                printf("\n请输入当前好感经验值（不确定填0）：");
                /*       if*/ (scanf(" %d", &y) == 1);while ((c = getchar()) != '\n' && c != EOF) {}
                //{ break; }
            //    else {
            //        printf("请输入一个整数！");
            //        while (getchar() != '\n');
            //    }
            //}
            //while (1) {
                printf("\n请输入目标好感度等级：");
                /*  if*/ (scanf(" %d", &z) == 1);while ((c = getchar()) != '\n' && c != EOF) {}
         //{ break; }
            //    else {
            //        printf("请输入一个整数！");
            //        while (getchar() != '\n');
            //    }
            //}
            if (x < 1 || z < 0 || z >100 || x > 100) {
                a = 1;
                printf("你输入的等级过小或大于100，请再次输入\n\n\n");
            }
            else if (z <= x) {
                a = 1;
                printf("目标好感等级不能小于等于目前好感等级！\n\n\n");
            }
            else
                a = 0;
            if (a == 0) { break; }
        }
        for (int i = x;i < z;i++) {
            b = b + table[i];
        }
        b = b + y;
        n = b / 15;
        if (b % 15 != 0) {
            n = n + 1;
        }
        else {
            n = n;
        }
        n1 = b / 20;
        if (b % 20 != 0) {
            n1 = n1 + 1;
        }
        else {
            n1 = n1;
        }
        n2 = b / 40;
        if (b % 40 != 0) {
            n2 = n2 + 1;
        }
        else {
            n2 = n2;
        }
        n3 = b / 60;
        if (b % 60 != 0) {
            n3 = n3 + 1;
        }
        else {
            n3 = n3;
        }
        n4 = b / 180;
        if (b % 180 != 0) {
            n4 = n4 + 1;
        }
        else {
            n4 = n4;
        }
        int n5 = 0;         //紫色礼物数量
        n5 = b / 120;
        if (b % 120 != 0) {
            n5 = n5 + 1;
        }
        else {
            n5 = n5;
        }
        int n6 = 0;        //爱心脸礼物数量
        n6 = b / 240;
        if (b % 240 != 0) {
            n6 = n6 + 1;
        }
        else {
            n6 = n6;
        }
        int n7 = 0;         //课程表次数
        n7 = 2*b / 65;
        if (b % 65 != 0) {
            n7 = n7 + 1;
        }
        else {
            n7 = n7;
        }
        int have = 0;       //已拥有经验
        for (int i1 = 0;i1 < x;i1++)
        {
            have = have + table[i1];
        }
        printf("\n\033[31m从%d级升级到%d级\33[0m\n",x, z);
        printf("已有经验：%d\n", have);
        printf("升级所需\033[36m经验\33[0m：%d\n", b);
        printf("所需\033[36m摸头\33[0m次数：%d\n", n);
        printf("所需\033[36m普通\33[0m礼物：%d\n", n1);
        printf("所需\033[36m满级课程表\33[0m期望次数：%d次\n", n7);
        printf("所需\033[36m微笑普通\33[0m礼物：%d\n", n2);
        printf("所需\033[36m大笑脸普通\33[0m礼物：%d\n", n3);
        printf("所需\033[36m紫色\33[0m礼物：%d\n", n5);
        printf("所需\033[36m大笑脸紫色\33[0m礼物：%d\n", n4);
        printf("所需\033[36m爱心脸紫色\33[0m礼物：%d\n", n6);





        char pro2 = '0';                        //记录是否进行天数估计
        printf("\n\033[33m是否需要进行达成天数估计？(需要请输“y”)：\33[0m");
        scanf(" %c",&pro2);
        while ((c = getchar()) != '\n' && c != EOF) {}
        if (pro2 == 'y' || pro2 == 'Y')
        {
            char choice2 = '0';                  //记录是否实装
            printf("\n\033[33m该角色是否实装？（实装请输“y”,否则没有实装无法计算课程表和摸头好感）：\33[0m");
            scanf(" %c", &choice2);
            while ((c = getchar()) != '\n' && c != EOF) {}
            double m = 0;                                           //普通礼物期望经验
            double n = 0;                                        //紫色礼物期望经验
            int d = 0;                                              //摸头次数
            int mk = 0;                                      //制造次数
            double mk2 = 0;
            double p = 32.5 * 175.0 / 230.0;                        //每次课程表的好感经验期望*学生出现概率
            int m1 = 0;                 //微笑脸
            int m2 = 0;                 //大笑脸
            int n1 = 0;                 //小紫
            int n2 = 0;                 //大紫
            if (choice2 == 'y' || choice2 == 'Y')
            {
                printf("\n每天摸几次头？:");                             //同理不会指针
                scanf(" %d", &d);while ((c = getchar()) != '\n' && c != EOF) {}
                printf("\n进行多少次制造？(3 or 6)：");
                scanf(" %d", &mk);while ((c = getchar()) != '\n' && c != EOF) {}
                printf("\n该角色有多少个微笑脸普通礼物？（不知道填期望值5）：");
                scanf(" %d", &m1);while ((c = getchar()) != '\n' && c != EOF) {}
                printf("\n该角色有多少个大笑脸脸礼物？（不知道填期望值2）：");
                scanf(" %d", &m2);while ((c = getchar()) != '\n' && c != EOF) {}
                printf("\n该角色有多少个大笑脸紫色礼物？（不知道填期望值1）：");
                scanf(" %d", &n1);while ((c = getchar()) != '\n' && c != EOF) {}
                printf("\n该角色有多少个爱心脸紫色礼物？（不知道填期望值1）：");
                scanf(" %d", &n2);while ((c = getchar()) != '\n' && c != EOF) {}
                n = (n2 * 240 + n1 * 180 + (13 - n1 - n2) * 120) / 13.0;
                m = (m1 * 40.0 + m2 * 60.0 + (35 - m1 - m2) * 20.0) / 35.0;
                printf("\n\033[31m按每月2次活动，每次活动3个紫色礼物，80个普通礼物计算\n计算课程表时采用期望概率与期望经验值\33[0m\n");
                d = d * 15;                                       //摸头总经验
                mk2 = mk * (2.45 * m + 0.32 * n);             //制造获得的总经验
                double all = 0;                                      //每日获得经验
                all = (12 *2* (3 * n + 80 * m) / 356.25)/*活动经验*/ + mk2/*制造*/ + d/*摸头*/ + p/*课程表*/;
                int day = 0;                         //所需整数天数
                day = b / all;
                double r = fmod(b, all);
                if (r != 0) {
                    day = day + 1;
                }
                else {
                    day = day;
                }
                double all2 = 0;
                int day2 = 0;
                all2 = all + (10 *2* 12 * 80 * (35 - m1 - m2)) / (35.0 * 356.25) + (10 * mk * 2.45  * (35 - m1 - m2)) / 35.0;
                day2 = b / all2;
                double r2 = fmod(b, all2);
                if (r2 != 0) {
                    day2 = day2 + 1;
                }
                else {
                    day2 = day2;
                }
                    printf("本次计算包括\033[36m活动经验，制造经验，摸头经验，课程表期望经验\33[0m\n");
                    printf("你的\033[36m每日经验\33[0m为%.2f\n", all);
                    printf("达成%d好感所需\033[36m天数\33[0m为%d天\n", z, day);
                    printf("若将普通礼物制造为大笑脸普通礼物\n");
                    printf("则\033[36m每日经验\33[0m为%.2f\n达成%d好感所需\033[36m天数\33[0m为%d天\n\n",all2,z,day2);
                    printf("\n\033[33m若要继续计算好感，请输入“y”:\33[0m\n");
                    scanf(" %c", &choice);while ((c = getchar()) != '\n' && c != EOF) {}
            }
            else
            {
                printf("\n进行多少次制造？(3 or 6)：");
                scanf(" %d", &mk);while ((c = getchar()) != '\n' && c != EOF) {}
                printf("\n该角色有多少个微笑脸普通礼物？（不知道填期望值5）：");
                scanf(" %d", &m1);while ((c = getchar()) != '\n' && c != EOF) {}
                printf("\n该角色有多少个大笑脸脸礼物？（不知道填期望值2）：");
                scanf(" %d", &m2);while ((c = getchar()) != '\n' && c != EOF) {}
                printf("\n该角色有多少个大笑脸紫色礼物？（不知道填期望值1）：");
                scanf(" %d", &n1);while ((c = getchar()) != '\n' && c != EOF) {}
                printf("\n该角色有多少个爱心脸紫色礼物？（不知道填期望值1）：");
                scanf(" %d", &n2);while ((c = getchar()) != '\n' && c != EOF) {}
                n = (n2 * 240 + n1 * 180 + (13 - n1 - n2) * 120) / 13.0;
                m = (m1 * 40.0 + m2 * 60.0 + (35 - m1 - m2) * 20.0) / 35.0;
                printf("\n\033[31m按每月2次活动，每次活动3个紫色礼物，80个普通礼物计算\33[0m\n");
                mk2 = mk * (2.45 * m + 0.32 * n);             //制造获得的总经验
                double all = 0;                                      //每日获得经验
                all = (12 *2* (3 * n + 80 * m) / 356.25)/*活动经验*/ + mk2/*制造*/;
                int day = 0;                         //所需整数天数
                day = b / all;
                double r = fmod(b, all);
                if (r != 0) {
                    day = day + 1;
                }
                else {
                    day = day;
                }
                double all2 = 0;
                int day2 = 0;
                all2 = all + (10*2*12*80*(35 - m1 - m2)) / (35.0*356.25)+ (10*mk *2.45* (35 - m1 - m2)) / 35.0;
                day2 = b / all2;
                double r2 = fmod(b, all2);
                if (r2 != 0) {
                    day2 = day2 + 1;
                }
                else {
                    day2 = day2;
                }
                printf("本次计算包括\033[36m活动经验，制造经验\33[0m\n");
                printf("你的\033[36m每日经验\33[0m为%.2f\n", all);
                printf("到%d好感所需攒礼物\033[36m天数\33[0m为%d天\n", z, day);
                printf("若将普通礼物制造为大笑脸普通礼物\n");
                printf("则\033[36m每日经验\33[0m为%.2f\n达成%d好感所需\033[36m天数\33[0m为%d天\n\n", all2, z, day2);
                printf("\n\033[33m若要继续计算好感，请输入“y”:\33[0m\n");
                scanf(" %c", &choice);while ((c = getchar()) != '\n' && c != EOF) {}
            }
        }
        else
        {
            printf("\n\033[33m若要继续计算好感，请输入“y”:\33[0m\n");
            scanf(" %c", &choice);while ((c = getchar()) != '\n' && c != EOF) {}
        }
    
        b = 0;
        have = 0;

    } while (choice == 'y' || choice == 'Y');
    printf("\n\033[31m程序已结束！\33[0m");
    while (1)
    { Sleep(1000); }
	return 0;
}